dic={"동연이":"010-4981-8834",
	"서진이":"010-2071-9628",
	"엄마":"010-3938-9285",
	"아빠":"010-2334-2860",
	"홍길동":"010-1234-5678",
	'륭이':'010-8528-2297',
	'성빈이':'010-9851-1151'}
dic2={
	'륭이':{"사는곳":"북가좌동 어딘가","전화번호":"010-8528-2297"},
	'동연이':{"사는곳":"북가좌동 Dmc","전화번호":"010-4981-8834"},
	'서진이':{"사는곳":"북가좌동 연희중 근처","전화번호":"010-2071-9628"},
	'성빈이':{"사는곳":"북가좌동 어딘가에 존재하는 포켓몬","전화번호":"010-9851-1151"}
}

while(True):
	name=input("원하는 사람의 이름을 적어주시오 : ")
	category=input("사는곳/전화번호 중 선택하시오 : ")
	print(dic2[name][category])
	more=input("검색을 더 할것이오? 네/아니오 : ")
	if(more=='네'):
		pass
	elif(more=='동연이 못생겼죠?'):
		print("인정하ㅇ.....크흠")
	elif(more=='대답하기 힘드시겠어요'):
		print("알아줘서 고맙구려")
	else:
		print("사용해줘서 고맙소")
		break
